Revit 2026 API

# RebarPresentationMode Enumeration

---

Bar presentation mode

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RebarPresentationMode
```
```vb
Public Enumeration RebarPresentationMode
```
```cpp
public enum class RebarPresentationMode
```
```fsharp
type RebarPresentationMode
```

| Member name | Value | Description |
| --- | --- | --- |
| All | 0 | All bars are presented. |
| FirstLast | 1 | The first and last bars are presented. |
| Middle | 2 | The middle bar is presented. |
| Select | 3 | Selected bars are presented. |

#### Reference

Autodesk.Revit.DB.Structure Namespace